app/controllers/replies_controller.rb

  def index
    @replies = Reply.all
---
SELECT * FROM "replies"

  def show
    @reply = Reply.find(params[:id])
---
SELECT * FROM "replies" WHERE ("replies"."id" = 1)

  def create
    @reply = Reply.new(params[:reply])
    puts params[:code]
    if @reply.save
---
INSERT INTO "replies" ("name", "engagement_children", "diet", "wedding_children", "created_at", "camping", "notes", "updated_at", "wedding_adults", "engagement_adults", "engagement", "wedding") VALUES('', NULL, '', NULL, '2010-04-25 21:47:27', NULL, '', '2010-04-25 21:47:27', NULL, NULL, NULL, NULL)

  def edit
    @reply = Reply.find(params[:id])
---
SELECT * FROM "replies" WHERE ("replies"."id" = 1)

  def csv
     @records = Reply.all
---
SELECT * FROM "replies"